const path = require('path');

/**
 * 定数定義
 */
module.exports = {
  //-----------------------------------------------
  // サーバー関係
  //-----------------------------------------------
  SERVER: {
    // ポート番号
    PORT: 3000,

    // 全世界に公開するフォルダ
    DOCUMENT_ROOT: path.resolve(__dirname, '../public'),
  },

  //-----------------------------------------------
  // ゲーム関係
  //-----------------------------------------------
  GAME: {
      // モニタリング間隔（ミリ秒）
      MONITORING_TIME: 1000,

      // 回答欄の座標とサイズ
      ANSWER_POS: {
        o:{ x: 300, y: 450, width: 150, height: 150 },
        x:{ x: 610, y: 450, width: 150, height: 150 },
      },

      // 回答
      ANSWER: {
        O: true,
        X: false,
        NOT_SELECT: null,
      }
  },

  //-----------------------------------------------
  // プレイヤー関係
  //-----------------------------------------------
  PLAYER: {
    // 最大同時参加者数
    MAXPLAYERS: 2,

    // アバター画像の一覧
    AVATARS: [
      '/image/user_arupaka.png',
      '/image/user_panda.png'
    ],

    // プレイヤー画像のサイズ（名前含む）
    SIZE: {
      width: 120,
      height: 150
    },
  },
}